In [26]:
import pandas as pd
df=pd.read_csv('pokemon.csv')
df

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [27]:
df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [28]:
#Dictionaries basics(multiple values)
people={
         'fname':['Diganta','Saswata','Dipanjan','Chayanika'],
         'lname':['Adak'   ,'Adak'   ,'Samanta','Makhal'],
         'Email':['digantaadak3@gmail.com','saswata3@gmail.com','dipanjansam4@gmail.com','makhalchayanika5@gmail.com']
       }

In [29]:
people['Email']

['digantaadak3@gmail.com',
 'saswata3@gmail.com',
 'dipanjansam4@gmail.com',
 'makhalchayanika5@gmail.com']

In [30]:
#Dataframe using same process
df1=pd.DataFrame(people)
df1

       fname    lname                       Email
0    Diganta     Adak      digantaadak3@gmail.com
1    Saswata     Adak          saswata3@gmail.com
2   Dipanjan  Samanta      dipanjansam4@gmail.com
3  Chayanika   Makhal  makhalchayanika5@gmail.com

In [31]:
df1['Email']

0        digantaadak3@gmail.com
1            saswata3@gmail.com
2        dipanjansam4@gmail.com
3    makhalchayanika5@gmail.com
Name: Email, dtype: object

In [32]:
type(df1['Email'])

pandas.core.series.Series

In [33]:
#How to print multiple columns
df1[['fname','Email']]

       fname                       Email
0    Diganta      digantaadak3@gmail.com
1    Saswata          saswata3@gmail.com
2   Dipanjan      dipanjansam4@gmail.com
3  Chayanika  makhalchayanika5@gmail.com

In [34]:
#How to Access all the columns
df1.columns

Index(['fname', 'lname', 'Email'], dtype='object')

In [35]:
#How to First row access
df1.iloc[0]

fname                   Diganta
lname                      Adak
Email    digantaadak3@gmail.com
Name: 0, dtype: object

In [36]:
df1.iloc[2]

fname                  Dipanjan
lname                   Samanta
Email    dipanjansam4@gmail.com
Name: 2, dtype: object

In [37]:
#How to Access  2 Rows data
df1.iloc[[0, 2]]

      fname    lname                   Email
0   Diganta     Adak  digantaadak3@gmail.com
2  Dipanjan  Samanta  dipanjansam4@gmail.com

In [38]:
#just email find
df1.loc[[0,1],'Email']

0    digantaadak3@gmail.com
1        saswata3@gmail.com
Name: Email, dtype: object

In [39]:
df1

       fname    lname                       Email
0    Diganta     Adak      digantaadak3@gmail.com
1    Saswata     Adak          saswata3@gmail.com
2   Dipanjan  Samanta      dipanjansam4@gmail.com
3  Chayanika   Makhal  makhalchayanika5@gmail.com

In [40]:
#how to acceess only lname and Email 0 and 2 no. rows:
df1.loc[[0,2],['Email','lname']]

                    Email    lname
0  digantaadak3@gmail.com     Adak
2  dipanjansam4@gmail.com  Samanta

In [41]:
df.shape  #800 rows and 13 columns

(800, 13)

In [42]:
df

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [25]:
df.columns

Index(['#', 'Name', 'Type 1', 'Type 2', 'Total', 'HP', 'Attack', 'Defense',
       'Sp. Atk', 'Sp. Def', 'Speed', 'Generation', 'Legendary'],
      dtype='object')

In [24]:
#value counts
df['Speed'].value_counts()

50     46
60     44
70     37
65     36
30     35
       ..
39      1
24      1
82      1
113     1
123     1
Name: Speed, Length: 108, dtype: int64

In [43]:
df.loc[0] #first row printed

#                     1
Name          Bulbasaur
Type 1            Grass
Type 2           Poison
Total               318
HP                   45
Attack               49
Defense              49
Sp. Atk              65
Sp. Def              65
Speed                45
Generation            1
Legendary         False
Name: 0, dtype: object

In [44]:
df.loc[0,'Name']  #0 row's name print

'Bulbasaur'

In [45]:
df.loc[[0,1,2,3],['Name','Speed','Generation','Legendary']]

                    Name  Speed  Generation  Legendary
0              Bulbasaur     45           1      False
1                Ivysaur     60           1      False
2               Venusaur     80           1      False
3  VenusaurMega Venusaur     80           1      False

In [46]:
df.loc[0:11, 'Name']  #Slicing with Columns

0                     Bulbasaur
1                       Ivysaur
2                      Venusaur
3         VenusaurMega Venusaur
4                    Charmander
5                    Charmeleon
6                     Charizard
7     CharizardMega Charizard X
8     CharizardMega Charizard Y
9                      Squirtle
10                    Wartortle
11                    Blastoise
Name: Name, dtype: object

In [47]:
df.loc[9,'Name']

'Squirtle'

In [48]:
df.columns

Index(['#', 'Name', 'Type 1', 'Type 2', 'Total', 'HP', 'Attack', 'Defense',
       'Sp. Atk', 'Sp. Def', 'Speed', 'Generation', 'Legendary'],
      dtype='object')

In [49]:
df.loc[0:9, 'Name':'HP']  #Multiple Column Slicing

                        Name Type 1  Type 2  Total  HP
0                  Bulbasaur  Grass  Poison    318  45
1                    Ivysaur  Grass  Poison    405  60
2                   Venusaur  Grass  Poison    525  80
3      VenusaurMega Venusaur  Grass  Poison    625  80
4                 Charmander   Fire     NaN    309  39
5                 Charmeleon   Fire     NaN    405  58
6                  Charizard   Fire  Flying    534  78
7  CharizardMega Charizard X   Fire  Dragon    634  78
8  CharizardMega Charizard Y   Fire  Flying    634  78
9                   Squirtle  Water     NaN    314  44

In [50]:
type(df)

pandas.core.frame.DataFrame

In [51]:
type(df['Name'])

pandas.core.series.Series